#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-RZq1KUEzF96jTT7y

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=education-eks-PvJaEFg920210822032427561500000002]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=education-eks-PvJaEFg920210822032427561500000002-20210822032427951300000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=education-eks-PvJaEFg920210822032427561500000002-20210822032427946300000003]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=education-eks-PvJaEFg920210822032427561500000002-20210822032427956300000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=education-eks-PvJaEFg920210822032427561500000002-20210822032427952800000005]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-0756b0a6cb6110a30]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0ace5e5f6e3ccd24f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-829459839]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-1141829673]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-197806921]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-613902773]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-3753062006]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-869694342]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=education-eks-PvJaEFg9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=education-eks-PvJaEFg92021082203341714260000000c]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=education-eks-PvJaEFg92021082203341714260000000c-2021082203341743730000000f]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=education-eks-PvJaEFg92021082203341737680000000e]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=education-eks-PvJaEFg92021082203341714260000000c-20210822033417439900000010]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=education-eks-PvJaEFg92021082203341714260000000c-20210822033417446700000011]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=education-eks-PvJaEFg92021082203341736640000000d]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=education-eks-PvJaEFg9-worker-group-220210822033417683300000012]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=education-eks-PvJaEFg9-worker-group-120210822033417686400000013]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=education-eks-PvJaEFg9-worker-group-220210822033428157800000014]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=education-eks-PvJaEFg9-worker-group-120210822033428188600000015]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      + body             = (known after apply)
      + ca_certificate   = (known after apply)
      + id               = (known after apply)
      + response_headers = (known after apply)
      + timeout          = 300
      + url              = (known after apply)
    }

  # module.eks.aws_autoscaling_group.workers[0] must be replaced
+/- resource "aws_autoscaling_group" "workers" {
      ~ arn                       = "arn:aws:autoscaling:ap-southeast-2:112227029085:autoScalingGroup:0afb9096-4783-4759-9600-62c5cf1af4f3:autoScalingGroupName/education-eks-PvJaEFg9-worker-group-120210822033428188600000015" -> (known after apply)
      ~ availability_zones        = [
          - "ap-southeast-2a",
          - "ap-southeast-2b",
          - "ap-southeast-2c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
      - enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "education-eks-PvJaEFg9-worker-group-120210822033428188600000015" -> (known after apply)
      ~ launch_configuration      = "education-eks-PvJaEFg9-worker-group-120210822033417686400000013" -> (known after apply)
      - load_balancers            = [] -> null
      ~ name                      = "education-eks-PvJaEFg9-worker-group-120210822033428188600000015" -> (known after apply)
      ~ name_prefix               = "education-eks-PvJaEFg9-worker-group-1" -> "mlops-eks-PvJaEFg9-worker-group-1" # forces replacement
      ~ service_linked_role_arn   = "arn:aws:iam::112227029085:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - target_group_arns         = [] -> null
      ~ vpc_zone_identifier       = [
          + "subnet-00dd6ad17f28e0110",
          + "subnet-073345847327cab44",
          + "subnet-0aff3cd4393d112eb",
            # (3 unchanged elements hidden)
        ]
        # (13 unchanged attributes hidden)

      - tag {
          - key                 = "GithubOrg" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform-aws-modules" -> null
        }
      - tag {
          - key                 = "GithubRepo" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform-aws-eks" -> null
        }
      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "education-eks-PvJaEFg9-worker-group-1-eks_asg" -> null
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "mlops-eks-PvJaEFg9-worker-group-1-eks_asg"
        }
      - tag {
          - key                 = "k8s.io/cluster/education-eks-PvJaEFg9" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
      + tag {
          + key                 = "k8s.io/cluster/mlops-eks-PvJaEFg9"
          + propagate_at_launch = true
          + value               = "owned"
        }
      - tag {
          - key                 = "kubernetes.io/cluster/education-eks-PvJaEFg9" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
      + tag {
          + key                 = "kubernetes.io/cluster/mlops-eks-PvJaEFg9"
          + propagate_at_launch = true
          + value               = "owned"
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] must be replaced
+/- resource "aws_autoscaling_group" "workers" {
      ~ arn                       = "arn:aws:autoscaling:ap-southeast-2:112227029085:autoScalingGroup:e78fcb71-042e-4205-9579-705e6cadc1d9:autoScalingGroupName/education-eks-PvJaEFg9-worker-group-220210822033428157800000014" -> (known after apply)
      ~ availability_zones        = [
          - "ap-southeast-2a",
          - "ap-southeast-2b",
          - "ap-southeast-2c",
        ] -> (known after apply)
      ~ default_cooldown          = 300 -> (known after apply)
      - enabled_metrics           = [] -> null
      ~ health_check_type         = "EC2" -> (known after apply)
      ~ id                        = "education-eks-PvJaEFg9-worker-group-220210822033428157800000014" -> (known after apply)
      ~ launch_configuration      = "education-eks-PvJaEFg9-worker-group-220210822033417683300000012" -> (known after apply)
      - load_balancers            = [] -> null
      ~ name                      = "education-eks-PvJaEFg9-worker-group-220210822033428157800000014" -> (known after apply)
      ~ name_prefix               = "education-eks-PvJaEFg9-worker-group-2" -> "mlops-eks-PvJaEFg9-worker-group-2" # forces replacement
      ~ service_linked_role_arn   = "arn:aws:iam::112227029085:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> (known after apply)
      - target_group_arns         = [] -> null
      ~ vpc_zone_identifier       = [
          + "subnet-00dd6ad17f28e0110",
          + "subnet-073345847327cab44",
          + "subnet-0aff3cd4393d112eb",
            # (3 unchanged elements hidden)
        ]
        # (13 unchanged attributes hidden)

      - tag {
          - key                 = "GithubOrg" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform-aws-modules" -> null
        }
      - tag {
          - key                 = "GithubRepo" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform-aws-eks" -> null
        }
      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "education-eks-PvJaEFg9-worker-group-2-eks_asg" -> null
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "mlops-eks-PvJaEFg9-worker-group-2-eks_asg"
        }
      - tag {
          - key                 = "k8s.io/cluster/education-eks-PvJaEFg9" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
      + tag {
          + key                 = "k8s.io/cluster/mlops-eks-PvJaEFg9"
          + propagate_at_launch = true
          + value               = "owned"
        }
      - tag {
          - key                 = "kubernetes.io/cluster/education-eks-PvJaEFg9" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
      + tag {
          + key                 = "kubernetes.io/cluster/mlops-eks-PvJaEFg9"
          + propagate_at_launch = true
          + value               = "owned"
        }
        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "mlops-eks-PvJaEFg9"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "training"
        }
      + tags_all              = {
          + "Environment" = "training"
        }
      + version               = "1.20"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-00dd6ad17f28e0110",
              + "subnet-02b7b75b8875b6f02",
              + "subnet-06dff361d9daa34ea",
              + "subnet-073345847327cab44",
              + "subnet-0a134ea213c4bf0e2",
              + "subnet-0aff3cd4393d112eb",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_instance_profile.workers[0] must be replaced
+/- resource "aws_iam_instance_profile" "workers" {
      ~ arn         = "arn:aws:iam::112227029085:instance-profile/education-eks-PvJaEFg92021082203341736640000000d" -> (known after apply)
      ~ create_date = "2021-08-22T03:34:17Z" -> (known after apply)
      ~ id          = "education-eks-PvJaEFg92021082203341736640000000d" -> (known after apply)
      ~ name        = "education-eks-PvJaEFg92021082203341736640000000d" -> (known after apply)
      ~ name_prefix = "education-eks-PvJaEFg9" -> "mlops-eks-PvJaEFg9" # forces replacement
      ~ role        = "education-eks-PvJaEFg92021082203341714260000000c" -> (known after apply)
      ~ tags        = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all    = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ unique_id   = "AIPARUIKASBORDAZ5L7AF" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_instance_profile.workers[1] must be replaced
+/- resource "aws_iam_instance_profile" "workers" {
      ~ arn         = "arn:aws:iam::112227029085:instance-profile/education-eks-PvJaEFg92021082203341737680000000e" -> (known after apply)
      ~ create_date = "2021-08-22T03:34:17Z" -> (known after apply)
      ~ id          = "education-eks-PvJaEFg92021082203341737680000000e" -> (known after apply)
      ~ name        = "education-eks-PvJaEFg92021082203341737680000000e" -> (known after apply)
      ~ name_prefix = "education-eks-PvJaEFg9" -> "mlops-eks-PvJaEFg9" # forces replacement
      ~ role        = "education-eks-PvJaEFg92021082203341714260000000c" -> (known after apply)
      ~ tags        = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all    = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ unique_id   = "AIPARUIKASBOZMT6MO6KQ" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] must be replaced
-/+ resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      ~ arn         = "arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001" -> (known after apply)
      ~ id          = "arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001" -> (known after apply)
      ~ name        = "education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001" -> (known after apply)
      ~ name_prefix = "education-eks-PvJaEFg9-elb-sl-role-creation" -> "mlops-eks-PvJaEFg9-elb-sl-role-creation" # forces replacement
      ~ policy_id   = "ANPARUIKASBOX5XGNPYYT" -> (known after apply)
        tags        = {
            "Environment" = "training"
        }
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.cluster[0] must be replaced
+/- resource "aws_iam_role" "cluster" {
      ~ arn                   = "arn:aws:iam::112227029085:role/education-eks-PvJaEFg920210822032427561500000002" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks.amazonaws.com"
                        }
                        Sid       = "EKSClusterAssumeRole"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-08-22T03:24:27Z" -> (known after apply)
      ~ id                    = "education-eks-PvJaEFg920210822032427561500000002" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001",
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSServicePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
      ~ name                  = "education-eks-PvJaEFg920210822032427561500000002" -> (known after apply)
      ~ name_prefix           = "education-eks-PvJaEFg9" -> "mlops-eks-PvJaEFg9" # forces replacement
        tags                  = {
            "Environment" = "training"
        }
      ~ unique_id             = "AROARUIKASBOXUYBBCZDB" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role.workers[0] must be replaced
+/- resource "aws_iam_role" "workers" {
      ~ arn                   = "arn:aws:iam::112227029085:role/education-eks-PvJaEFg92021082203341714260000000c" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ec2.amazonaws.com"
                        }
                        Sid       = "EKSWorkerAssumeRole"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2021-08-22T03:34:17Z" -> (known after apply)
      ~ id                    = "education-eks-PvJaEFg92021082203341714260000000c" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> (known after apply)
      ~ name                  = "education-eks-PvJaEFg92021082203341714260000000c" -> (known after apply)
      ~ name_prefix           = "education-eks-PvJaEFg9" -> "mlops-eks-PvJaEFg9" # forces replacement
      ~ tags                  = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ tags_all              = {
          - "GithubOrg"   = "terraform-aws-modules" -> null
          - "GithubRepo"  = "terraform-aws-eks" -> null
            # (1 unchanged element hidden)
        }
      ~ unique_id             = "AROARUIKASBO5IF5JQANC" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      ~ id         = "education-eks-PvJaEFg920210822032427561500000002-20210822032427946300000003" -> (known after apply)
      ~ role       = "education-eks-PvJaEFg920210822032427561500000002" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      ~ id         = "education-eks-PvJaEFg920210822032427561500000002-20210822032427952800000005" -> (known after apply)
      ~ role       = "education-eks-PvJaEFg920210822032427561500000002" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      ~ id         = "education-eks-PvJaEFg920210822032427561500000002-20210822032427956300000006" -> (known after apply)
      ~ role       = "education-eks-PvJaEFg920210822032427561500000002" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      ~ id         = "education-eks-PvJaEFg920210822032427561500000002-20210822032427951300000004" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::112227029085:policy/education-eks-PvJaEFg9-elb-sl-role-creation20210822032427556600000001" -> (known after apply) # forces replacement
      ~ role       = "education-eks-PvJaEFg920210822032427561500000002" -> (known after apply) # forces replacement
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      ~ id         = "education-eks-PvJaEFg92021082203341714260000000c-20210822033417446700000011" -> (known after apply)
      ~ role       = "education-eks-PvJaEFg92021082203341714260000000c" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      ~ id         = "education-eks-PvJaEFg92021082203341714260000000c-2021082203341743730000000f" -> (known after apply)
      ~ role       = "education-eks-PvJaEFg92021082203341714260000000c" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      ~ id         = "education-eks-PvJaEFg92021082203341714260000000c-20210822033417439900000010" -> (known after apply)
      ~ role       = "education-eks-PvJaEFg92021082203341714260000000c" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:6e383f6b-16d9-4284-9422-4c5aeae60ce7:launchConfigurationName/education-eks-PvJaEFg9-worker-group-120210822033417686400000013" -> (known after apply)
      ~ iam_instance_profile             = "education-eks-PvJaEFg92021082203341736640000000d" -> (known after apply) # forces replacement
      ~ id                               = "education-eks-PvJaEFg9-worker-group-120210822033417686400000013" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "education-eks-PvJaEFg9-worker-group-120210822033417686400000013" -> (known after apply)
      ~ name_prefix                      = "education-eks-PvJaEFg9-worker-group-1" -> "mlops-eks-PvJaEFg9-worker-group-1" # forces replacement
      ~ security_groups                  = [
          - "sg-00a9df337c017e67f",
          - "sg-0756b0a6cb6110a30",
        ] -> (known after apply) # forces replacement
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmFrRjZUWHBCZWs0eGIxaEVWRTE0VFVSbmVVMUVRWHBOZWtGNlRqRnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVDAxUENtVlRiekpHYmxoWVp6Uk1USFF4TVhaUGFTOUVXRm95U1RkMU4zVmFURVpJWVRNNGRYUjZUSEEzZUVVcmNrazROa2hIVFc5MlpHcEdNRU5WTkN0dVFrc0taek14V1VkQ1RXZElVblZyYUZCeFZsY3JSM2xsWkZCQmVrcG1iMHRDWTA4cmRIUkpZbkJzVUhkbFpIbFlla0pXZWpkeEszWjZiVTVaUkhCTk5HSXpOQXB3U1Roc1dGaFNWVE5rT1RkSk1HaEpaR055S3pJemVETk9OMWRyWnl0S1ZsZFFXbGcxWWt0UmJ6ZFVTSFpMV1cxSVozTlBVRE5UVFU4d1IxcHdia1FyQ2tOa01WQkpUV2gyZFhkQlp6SlpiMUp5YzBoMmEyODVTRkprVTNWbWMxSTNZakIxUW5oNVJVMWpaVkZHV0VWdk5WRjNUMUJQY2pGeFJ6WTVhME54TWxnS1N5dEpiWGxWVW1kaVlXRTROMlpuTDJSNlFVUklWMGRzVVdGMk9XbHZWM3BRU0hoS1Z6TnVhWGN6YjBJd05FWnBjMmxDWm1WU01rTkxTR1pOU0hKUlNBcFVjVmhwTjJWSVZ6aFBSM0UxVUVWSGEwZzRRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWktTa1JwZHpBNFRVZ3ZTbXRvTTFOVGJFYzNVM0JxVDNOT09GZE5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkNlRzByVVZaWFpHNUZSR1pWT1d0NVIzVlVabTlaUzBwNVRuaFRkR1psWjI4d2JtRmhNRFU1YXpBelZXMUNTR2x2UkFwRVMyNWFNVTFLTmpCa1pXMXdjSGR2ZFhKUGFVWndMMUJwY21wWFJGVnhUMWxPYWpCNWNHVkJjbGx1UmtoSVdubHJlVTB3Y1RWcWJVWnJkbTV4SzA1WENpdGxkMk5HWTFGNGRVMUVRV1JVVlZGTE4yVjZOamxUVmk4NFFXeExNbXRSZEdkQmNsZFVWaTlKVVU1eWJHRlFWRFYxTTNsd1FqVXZOMFZwWVZKRVdXa0tNM3BtWkRaSmRXVk1VUzgyVDJnMWNtbDRhWHBhVlRaQ1VYRXJZVWg1VkZOT1NuUXJVaklyVmk5MmJGbElMMUJDY1RkU2NEbDFVMkpXY2xvNVZDdG5aQXB1VWtWWllrTXZPV05oTjJaRkswUnJabEJwZUN0VkwwOHpaVFZ6VnpKTmRuaFBZVzVoVGpaVVpEQTNNRzlwWVdoNUszUnliV3cxUm5saWMxRjRkMjVYQ2pJMk0wMHhUVFV6U2paeFFtWnFaSEZyUzBKaVZISkdObVJRYUU1bVJ6WkRjM0p6Y3dvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vRkNCMEEyMTUyNjQyMDg0QTUwMThFQkU5M0NFREY2ODMuZ3I3LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ2VkdWNhdGlvbi1la3MtUHZKYUVGZzknCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgdXNlcmRhdGEgY29kZQplY2hvIGZvbyBiYXIK" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (5 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:043290cd-74fa-417b-bc51-61e2f5c42f75:launchConfigurationName/education-eks-PvJaEFg9-worker-group-220210822033417683300000012" -> (known after apply)
      ~ iam_instance_profile             = "education-eks-PvJaEFg92021082203341737680000000e" -> (known after apply) # forces replacement
      ~ id                               = "education-eks-PvJaEFg9-worker-group-220210822033417683300000012" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "education-eks-PvJaEFg9-worker-group-220210822033417683300000012" -> (known after apply)
      ~ name_prefix                      = "education-eks-PvJaEFg9-worker-group-2" -> "mlops-eks-PvJaEFg9-worker-group-2" # forces replacement
      ~ security_groups                  = [
          - "sg-0756b0a6cb6110a30",
          - "sg-081c66a871fd32313",
        ] -> (known after apply) # forces replacement
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmFrRjZUWHBCZWs0eGIxaEVWRTE0VFVSbmVVMUVRWHBOZWtGNlRqRnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVDAxUENtVlRiekpHYmxoWVp6Uk1USFF4TVhaUGFTOUVXRm95U1RkMU4zVmFURVpJWVRNNGRYUjZUSEEzZUVVcmNrazROa2hIVFc5MlpHcEdNRU5WTkN0dVFrc0taek14V1VkQ1RXZElVblZyYUZCeFZsY3JSM2xsWkZCQmVrcG1iMHRDWTA4cmRIUkpZbkJzVUhkbFpIbFlla0pXZWpkeEszWjZiVTVaUkhCTk5HSXpOQXB3U1Roc1dGaFNWVE5rT1RkSk1HaEpaR055S3pJemVETk9OMWRyWnl0S1ZsZFFXbGcxWWt0UmJ6ZFVTSFpMV1cxSVozTlBVRE5UVFU4d1IxcHdia1FyQ2tOa01WQkpUV2gyZFhkQlp6SlpiMUp5YzBoMmEyODVTRkprVTNWbWMxSTNZakIxUW5oNVJVMWpaVkZHV0VWdk5WRjNUMUJQY2pGeFJ6WTVhME54TWxnS1N5dEpiWGxWVW1kaVlXRTROMlpuTDJSNlFVUklWMGRzVVdGMk9XbHZWM3BRU0hoS1Z6TnVhWGN6YjBJd05FWnBjMmxDWm1WU01rTkxTR1pOU0hKUlNBcFVjVmhwTjJWSVZ6aFBSM0UxVUVWSGEwZzRRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWktTa1JwZHpBNFRVZ3ZTbXRvTTFOVGJFYzNVM0JxVDNOT09GZE5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkNlRzByVVZaWFpHNUZSR1pWT1d0NVIzVlVabTlaUzBwNVRuaFRkR1psWjI4d2JtRmhNRFU1YXpBelZXMUNTR2x2UkFwRVMyNWFNVTFLTmpCa1pXMXdjSGR2ZFhKUGFVWndMMUJwY21wWFJGVnhUMWxPYWpCNWNHVkJjbGx1UmtoSVdubHJlVTB3Y1RWcWJVWnJkbTV4SzA1WENpdGxkMk5HWTFGNGRVMUVRV1JVVlZGTE4yVjZOamxUVmk4NFFXeExNbXRSZEdkQmNsZFVWaTlKVVU1eWJHRlFWRFYxTTNsd1FqVXZOMFZwWVZKRVdXa0tNM3BtWkRaSmRXVk1VUzgyVDJnMWNtbDRhWHBhVlRaQ1VYRXJZVWg1VkZOT1NuUXJVaklyVmk5MmJGbElMMUJDY1RkU2NEbDFVMkpXY2xvNVZDdG5aQXB1VWtWWllrTXZPV05oTjJaRkswUnJabEJwZUN0VkwwOHpaVFZ6VnpKTmRuaFBZVzVoVGpaVVpEQTNNRzlwWVdoNUszUnliV3cxUm5saWMxRjRkMjVYQ2pJMk0wMHhUVFV6U2paeFFtWnFaSEZyUzBKaVZISkdObVJRYUU1bVJ6WkRjM0p6Y3dvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vRkNCMEEyMTUyNjQyMDg0QTUwMThFQkU5M0NFREY2ODMuZ3I3LmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ2VkdWNhdGlvbi1la3MtUHZKYUVGZzknCgojIEFsbG93IHVzZXIgc3VwcGxpZWQgdXNlcmRhdGEgY29kZQplY2hvIGZvbyBiYXIK" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (5 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_security_group.cluster[0] must be replaced
+/- resource "aws_security_group" "cluster" {
      ~ arn                    = "arn:aws:ec2:ap-southeast-2:112227029085:security-group/sg-0ace5e5f6e3ccd24f" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow cluster egress access to the Internet."
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0ace5e5f6e3ccd24f" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow pods to communicate with the EKS cluster API."
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0756b0a6cb6110a30",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "education-eks-PvJaEFg920210822032448840800000008" -> (known after apply)
      ~ name_prefix            = "education-eks-PvJaEFg9" -> "mlops-eks-PvJaEFg9" # forces replacement
      ~ owner_id               = "112227029085" -> (known after apply)
      ~ tags                   = {
          ~ "Name"        = "education-eks-PvJaEFg9-eks_cluster_sg" -> "mlops-eks-PvJaEFg9-eks_cluster_sg"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          ~ "Name"        = "education-eks-PvJaEFg9-eks_cluster_sg" -> "mlops-eks-PvJaEFg9-eks_cluster_sg"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.workers[0] must be replaced
+/- resource "aws_security_group" "workers" {
      ~ arn                    = "arn:aws:ec2:ap-southeast-2:112227029085:security-group/sg-0756b0a6cb6110a30" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow nodes all egress to the Internet."
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0756b0a6cb6110a30" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow node to communicate with each other."
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0ace5e5f6e3ccd24f",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow workers pods to receive communication from the cluster control plane."
              - from_port        = 1025
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0ace5e5f6e3ccd24f",
                ]
              - self             = false
              - to_port          = 65535
            },
        ] -> (known after apply)
      ~ name                   = "education-eks-PvJaEFg920210822032448857200000009" -> (known after apply)
      ~ name_prefix            = "education-eks-PvJaEFg9" -> "mlops-eks-PvJaEFg9" # forces replacement
      ~ owner_id               = "112227029085" -> (known after apply)
      ~ tags                   = {
          ~ "Name"                                         = "education-eks-PvJaEFg9-eks_worker_sg" -> "mlops-eks-PvJaEFg9-eks_worker_sg"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "owned" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "owned"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          ~ "Name"                                         = "education-eks-PvJaEFg9-eks_worker_sg" -> "mlops-eks-PvJaEFg9-eks_worker_sg"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "owned" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "owned"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster_egress_internet[0] must be replaced
+/- resource "aws_security_group_rule" "cluster_egress_internet" {
      ~ id                       = "sgrule-3753062006" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0ace5e5f6e3ccd24f" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] must be replaced
+/- resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-197806921" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0ace5e5f6e3ccd24f" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-0756b0a6cb6110a30" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.workers_egress_internet[0] must be replaced
+/- resource "aws_security_group_rule" "workers_egress_internet" {
      ~ id                       = "sgrule-1141829673" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0756b0a6cb6110a30" -> (known after apply) # forces replacement
      + source_security_group_id = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster[0] must be replaced
+/- resource "aws_security_group_rule" "workers_ingress_cluster" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-869694342" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0756b0a6cb6110a30" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-0ace5e5f6e3ccd24f" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] must be replaced
+/- resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-613902773" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0756b0a6cb6110a30" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-0ace5e5f6e3ccd24f" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_security_group_rule.workers_ingress_self[0] must be replaced
+/- resource "aws_security_group_rule" "workers_ingress_self" {
      - cidr_blocks              = [] -> null
      ~ id                       = "sgrule-829459839" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      ~ security_group_id        = "sg-0756b0a6cb6110a30" -> (known after apply) # forces replacement
      ~ source_security_group_id = "sg-0756b0a6cb6110a30" -> (known after apply) # forces replacement
      ~ to_port                  = 0 -> 65535
        # (5 unchanged attributes hidden)
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = (known after apply)
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_mlops-eks-PvJaEFg9"
      + id                   = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0b18743b4b7302c8f"
      ~ tags                 = {
          ~ "Name"                                         = "education-vpc-ap-southeast-2a" -> "mlops-vpc-ap-southeast-2a"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
      ~ tags_all             = {
          ~ "Name"                                         = "education-vpc-ap-southeast-2a" -> "mlops-vpc-ap-southeast-2a"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0374fd609632adf7d"
      ~ tags     = {
          ~ "Name"                                         = "education-vpc" -> "mlops-vpc"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
      ~ tags_all = {
          ~ "Name"                                         = "education-vpc" -> "mlops-vpc"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-05b5a62b36b141900"
      ~ tags                 = {
          ~ "Name"                                         = "education-vpc-ap-southeast-2a" -> "mlops-vpc-ap-southeast-2a"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
      ~ tags_all             = {
          ~ "Name"                                         = "education-vpc-ap-southeast-2a" -> "mlops-vpc-ap-southeast-2a"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-06028b53eb644fe96"
      ~ tags             = {
          ~ "Name"                                         = "education-vpc-private" -> "mlops-vpc-private"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
      ~ tags_all         = {
          ~ "Name"                                         = "education-vpc-private" -> "mlops-vpc-private"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-02d825833703ae3e8"
      ~ tags             = {
          ~ "Name"                                         = "education-vpc-public" -> "mlops-vpc-public"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
      ~ tags_all         = {
          ~ "Name"                                         = "education-vpc-public" -> "mlops-vpc-public"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-02b7b75b8875b6f02"
      ~ tags                            = {
          ~ "Name"                                         = "education-vpc-private-ap-southeast-2a" -> "mlops-vpc-private-ap-southeast-2a"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
      ~ tags_all                        = {
          ~ "Name"                                         = "education-vpc-private-ap-southeast-2a" -> "mlops-vpc-private-ap-southeast-2a"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-06dff361d9daa34ea"
      ~ tags                            = {
          ~ "Name"                                         = "education-vpc-private-ap-southeast-2b" -> "mlops-vpc-private-ap-southeast-2b"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
      ~ tags_all                        = {
          ~ "Name"                                         = "education-vpc-private-ap-southeast-2b" -> "mlops-vpc-private-ap-southeast-2b"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                              = "subnet-0a134ea213c4bf0e2"
      ~ tags                            = {
          ~ "Name"                                         = "education-vpc-private-ap-southeast-2c" -> "mlops-vpc-private-ap-southeast-2c"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
      ~ tags_all                        = {
          ~ "Name"                                         = "education-vpc-private-ap-southeast-2c" -> "mlops-vpc-private-ap-southeast-2c"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-0aff3cd4393d112eb"
      ~ tags                            = {
          ~ "Name"                                         = "education-vpc-public-ap-southeast-2a" -> "mlops-vpc-public-ap-southeast-2a"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
      ~ tags_all                        = {
          ~ "Name"                                         = "education-vpc-public-ap-southeast-2a" -> "mlops-vpc-public-ap-southeast-2a"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-073345847327cab44"
      ~ tags                            = {
          ~ "Name"                                         = "education-vpc-public-ap-southeast-2b" -> "mlops-vpc-public-ap-southeast-2b"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
      ~ tags_all                        = {
          ~ "Name"                                         = "education-vpc-public-ap-southeast-2b" -> "mlops-vpc-public-ap-southeast-2b"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                              = "subnet-00dd6ad17f28e0110"
      ~ tags                            = {
          ~ "Name"                                         = "education-vpc-public-ap-southeast-2c" -> "mlops-vpc-public-ap-southeast-2c"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
      ~ tags_all                        = {
          ~ "Name"                                         = "education-vpc-public-ap-southeast-2c" -> "mlops-vpc-public-ap-southeast-2c"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
            # (1 unchanged element hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-075b2168a8a54d959"
      ~ tags                             = {
          ~ "Name"                                         = "education-vpc" -> "mlops-vpc"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
      ~ tags_all                         = {
          ~ "Name"                                         = "education-vpc" -> "mlops-vpc"
          - "kubernetes.io/cluster/education-eks-PvJaEFg9" = "shared" -> null
          + "kubernetes.io/cluster/mlops-eks-PvJaEFg9"     = "shared"
        }
        # (14 unchanged attributes hidden)
    }

Plan: 27 to add, 12 to change, 24 to destroy.

Changes to Outputs:
  ~ cluster_endpoint          = "https://FCB0A2152642084A5018EBE93CEDF683.gr7.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
  ~ cluster_id                = "education-eks-PvJaEFg9" -> (known after apply)
  ~ cluster_name              = "education-eks-PvJaEFg9" -> "mlops-eks-PvJaEFg9"
  ~ cluster_security_group_id = "sg-0ace5e5f6e3ccd24f" -> (known after apply)
  ~ config_map_aws_auth       = [
      ~ {
          ~ data        = {
              - "mapAccounts" = jsonencode([])
              - "mapRoles"    = <<-EOT
                    - "groups":
                      - "system:bootstrappers"
                      - "system:nodes"
                      "rolearn": "arn:aws:iam::112227029085:role/education-eks-PvJaEFg92021082203341714260000000c"
                      "username": "system:node:{{EC2PrivateDNSName}}"
                EOT
              - "mapUsers"    = jsonencode([])
            } -> (known after apply)
          ~ id          = "kube-system/aws-auth" -> (known after apply)
          ~ metadata    = [
              ~ {
                  ~ generate_name    = "" -> null
                  ~ generation       = 0 -> (known after apply)
                  ~ resource_version = "622" -> (known after apply)
                  ~ uid              = "bc070df1-425b-4730-be1e-7a0d22233be4" -> (known after apply)
                    # (4 unchanged elements hidden)
                },
            ]
            # (1 unchanged element hidden)
        },
    ]
  ~ kubectl_config            = <<-EOT
        apiVersion: v1
        preferences: {}
        kind: Config
        
        clusters:
        - cluster:
            server: https://FCB0A2152642084A5018EBE93CEDF683.gr7.ap-southeast-2.eks.amazonaws.com
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNakF6TXpBek4xb1hEVE14TURneU1EQXpNekF6TjFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBT01PCmVTbzJGblhYZzRMTHQxMXZPaS9EWFoySTd1N3VaTEZIYTM4dXR6THA3eEUrckk4NkhHTW92ZGpGMENVNCtuQksKZzMxWUdCTWdIUnVraFBxVlcrR3llZFBBekpmb0tCY08rdHRJYnBsUHdlZHlYekJWejdxK3Z6bU5ZRHBNNGIzNApwSThsWFhSVTNkOTdJMGhJZGNyKzIzeDNON1drZytKVldQWlg1YktRbzdUSHZLWW1IZ3NPUDNTTU8wR1pwbkQrCkNkMVBJTWh2dXdBZzJZb1Jyc0h2a285SFJkU3Vmc1I3YjB1Qnh5RU1jZVFGWEVvNVF3T1BPcjFxRzY5a0NxMlgKSytJbXlVUmdiYWE4N2ZnL2R6QURIV0dsUWF2OWlvV3pQSHhKVzNuaXczb0IwNEZpc2lCZmVSMkNLSGZNSHJRSApUcVhpN2VIVzhPR3E1UEVHa0g4Q0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZKSkRpdzA4TUgvSmtoM1NTbEc3U3BqT3NOOFdNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCeG0rUVZXZG5FRGZVOWt5R3VUZm9ZS0p5TnhTdGZlZ28wbmFhMDU5azAzVW1CSGlvRApES25aMU1KNjBkZW1wcHdvdXJPaUZwL1BpcmpXRFVxT1lOajB5cGVBclluRkhIWnlreU0wcTVqbUZrdm5xK05XCitld2NGY1F4dU1EQWRUVVFLN2V6NjlTVi84QWxLMmtRdGdBcldUVi9JUU5ybGFQVDV1M3lwQjUvN0VpYVJEWWkKM3pmZDZJdWVMUS82T2g1cml4aXpaVTZCUXErYUh5VFNOSnQrUjIrVi92bFlIL1BCcTdScDl1U2JWclo5VCtnZApuUkVZYkMvOWNhN2ZFK0RrZlBpeCtVL08zZTVzVzJNdnhPYW5hTjZUZDA3MG9pYWh5K3RybWw1Rnlic1F4d25XCjI2M00xTTUzSjZxQmZqZHFrS0JiVHJGNmRQaE5mRzZDc3JzcwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
          name: eks_education-eks-PvJaEFg9
        
        contexts:
        - context:
            cluster: eks_education-eks-PvJaEFg9
            user: eks_education-eks-PvJaEFg9
          name: eks_education-eks-PvJaEFg9
        
        current-context: eks_education-eks-PvJaEFg9
        
        users:
        - name: eks_education-eks-PvJaEFg9
          user:
            exec:
              apiVersion: client.authentication.k8s.io/v1alpha1
              command: aws-iam-authenticator
              args:
                - "token"
                - "-i"
                - "education-eks-PvJaEFg9"
    EOT -> (known after apply)

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*